Tekla Open API Reference for Tekla Structures 2025
ViewBase.GetAllObjects Method
Overload List
Name | Description
GetAllObjects()
 Gets all the objects and their children objects in the view.
GetAllObjects(Type)
 Gets all the objects and their children objects in the view that are of a certain type.
GetAllObjects(Type[])
 Gets all the objects and their children objects in the view that are of certain types.
Top
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace